Repository: heinrichelsigan/schnapslet
Catalog: asp.net/SchnapsNet/Properties/Resource_*.resx
Languages: de, fr

# action_about
source: About
de: Info
fr: information

# action_continue
source: Continue
de: Weiter
fr: continuer

# action_exit
source: Exit
de: Beenden
fr: sortie d'application

# action_help
source: Help
de: Hilfe
fr: aide

# action_load
source: Load game
de: Spiel laden
fr: obtenir le jeu

# action_save
source: Save game
de: Spiel speichern
fr: sauvegarder la partie

# action_screenshot
source: ScreenShot
de: Bildschirmfoto
fr: capture d'écran

# action_settings
source: Settings
fr: paramètres

# action_start
source: Start
fr: début

# action_stop
source: Stop
de: Neustart
fr: replay

# atou_is
source: Atou is {0}!
de: Atou ist {0}!
fr: atou c'est {0}!

# b20a_text
source: Marriage 20
de: 20 ansagen
fr: mariage à 20

# b20b_text
source: Atou marriage 40
de: 40 ansagen
fr: mariage à 40

# back_button
source: Back
de: Zurück
fr: précédent

# bChange_text
source: Change Atou
de: Atou tauschen
fr: échanger atou

# bContinue_text
source: Continue
de: Weiter
fr: continuer

# best_card_would_be
source: Best card would be: {0}
de: Beste Karte wäre: {0}
fr: la meilleure carte serait: {0}

# bHelp_text
source: Help
de: Hilfe
fr: aide

# bStart_text
source: Start
fr: début

# bStop_text
source: Stop
de: Ende
fr: fin

# build_with
source: VisualStudio 2022 C# 4.8
de: Erzeugt mit VisualStudio 2022
fr: another Java or C# compiler

source: carddeck
de: Kartendeck
fr: l'origin de cartes

# cardval_10
source: Ten
de: Zehn
fr: dix

# cardval_11
source: Ace
de: Ass
fr: as

# cardval_2
source: Jack
de: Bube
fr: valet

# cardval_3
source: Queen
de: Dame
fr: reine

# cardval_4
source: King
de: König
fr: roi

# click_continue
source: Click on Continue!
de: Klicken Sie auf Weiter !
fr: cliquez sur continuer!

source: close game
de: Zudrehen
fr: on annonce la clôture

# closing_failed
source: You failed to close this game, computer wins!
de: Zudrehen fehlgeschlagen, Computer hat gewonnen !
fr: votre clôture manqué, l'ordinateur a gagné!

# colorDelimiter
source: of
de: in
fr: de

# color_e
source: empty card
de: Leerkarte
fr: carte vide

# color_h
source: hearts
fr: coeur

# color_hit_force_mode
source: No more cards in talon -> follow the suit led otherwise must trump (if possible).
de: Keine Karten im Talon -> Farb- und Stichzwang !
fr: aucune carte dans le talon -> clôture!

# color_k
source: diamonds
fr: carreau

# color_n
source: nocolor
de: Keine Karte
fr: sans couleur

# color_p
source: spades
fr: pique

# color_t
source: clubs
fr: trèfle

source: computer
fr: ordinateur

# computer_changes_atou
source: Computer changes Atou card.
de: Computer tauscht Atou aus.
fr: l'ordinateur échange atou.

# computer_closed_game
source: Computer closes game!
de: Computer dreht zu !
fr: l'ordinateur annonce la clôture!

# computer_closing_failed
source: Computer failed closing the game, you win!
de: Zudrehen des Computers fehlgeschlagen, sie haben gewonnen !
fr: clôture de l'ordinateur manqué, vous avez gagné!

# computer_has_won_points
source: Computer won with {0} points!
de: Computer hat mit {0} Punkten gewonnen!
fr: l'ordinateur a gagné avec {0} points!

# computer_hit_points
source: Computer hits with {0} points.
de: Computer sticht mit {0} Punkten.
fr: l'ordinateur remporte avec {0} points.

source: Computer plays out
de: Computer spielt aus
fr: l'ordinateur joue une carte

# computer_says_pair
source: computer announces a marriages in color {0}
de: Computer sagt Paar in {0} an!
fr: l'ordinateur announce marriage à {0}!

# computer_wins_last_hit
source: Last trick: computer wins!
de: Letzter Stich: Computer hat gewonnen !
fr: dernier point: l'ordinateur a gagné!

# creating_players
source: Creating new players
de: Erzeuge neuer Spieler Instanzen
fr: créer de nouvelles instances de joueur

source: default cards
de: Standard Kartendeck
fr: cartes normales

source: Ending game!
de: Beende das aktuelle Spiel
fr: terminez la partie en cours!

source: english cards
fr: cartes d'Angleterre

# fourty_and_enough
source: Forty and enough !
de: 40 und genug !
fr: quarante et finit!

# fourty_in_color
source: Forty in
de: Vierzig in
fr: quarante en marriage de

source: french cards
de: Französisches Kartendeck
fr: cartes de France royal

source: german cards
de: Doppeldeutsches Kartendeck
fr: cartes de Suisse

# github_uri
source: https://github.com/heinrichelsigan/schnapslet
de: https://github.com/heinrichelsigan/schnapslet/wiki
fr: https://github.com/heinrichelsigan/schnapslet/wiki

# help_text
source: <h1>Schnapslet v3.24.0102 - Pre Alpha Release</h1> Implementation of the card game Schnapsen as a simple Asp.Net WebApp by Heinrich Elsigan (<a href="mailto:he@area23.at">heinrich.elsigan@area23.at</a>). <br /> Schnapslet is open source under GPL 3 and publicly accessible via <a href="https://github.com/" target="_blank">GitHub</a> repository <a href="https://github.com/heinrichelsigan/schnapslet" target="_blank">github.com/heinrichelsigan/schnapslet</a>. <hr /> <h2>Functionality:</h2> <p>The game is designed to play against the computer. When it is your turn, you can play a card by clicking on the card icon. Other options, such as "<i>Exchange Atou</i>" or "<i>Announce a pair in [<b>CardColor</b>]</i>" are possible via the buttons below the card symbols; these options must be chosen before playing a card! <br /> When it is computer's turn, it plays a card and you can click on your own cards to trick or give up! The rules correspond to the Austrian Schnapsen, but there are still small bugs! <br /> '<i>Closing Game</i>' is implemented: You just have to click on the <b>atou (trump)</b> card. </p> <hr /> Ideas, suggestions, improvements are gladly accepted! <br /> Rules correspond to the Austrian <a href="https://en.wikipedia.org/wiki/Schnapsen" target="_blank">Schnapsen</a>.
de: Schnapslet v2.23.43 - Pre Alpha Release Implementierung des Kartenspiel Schnapsen als einfache Asp.Net WebApp von Heinrich Elsigan (heinrich.elsigan@area23.at) Funktionsweise: Das Spiel ist so angelegt, dass man gegen den Computer spielt. Ist man am Zug, so kann man eine Karte ausspielen, indem man auf das Kartensymbol klickt. Andere Optionen, wie "Atou austauschen" oder "Ein Paar Ansagen" sind ueber die Buttons unterhalb der Kartensymbole moeglich; diese Optionen muessen gewaehlt werden, bevor man eine Karte auspielt! Ist der Computer am Zug, so spielt dieser eine Karte aus und man selbst kann dann durch Klick auf die eigenen Karten, stechen oder draufgeben! Die Regeln entsprechen dem oesterreichischen Schnapsen, allerdings gibt es bei noch kleine Bugs! Zudrehen ist implementiert: Man muss einfach auf die Atou Karte klicken. Ideen, Vorschlaege, Verbesserungen werden gerne angenommen!
fr: Schnapslet v2.4.8 (root@darkstar.work) Jeu de cartes Schnapsen application android de Heinrich Elsigan. Le jeu est conçu pour jouer contre l'ordinateur. Si c'est votre tour, vous pouvez jouer une carte en cliquant sur son icône et en la faisant glisser dans le presse-papiers. Pour échanger Atou, vous pouvez tirer le Jack Atou sur la carte Atou ci-dessus et pour annoncer une paire, vous appelez la reine au roi correspondant ou inversement. "échanger" ou "quelques annonces" peuvent également être lus via les boutons correspondants; Si l'ordinateur est sur le tour, il joue une carte et vous pouvez ensuite sélectionner votre propre carte puis tirer sur le clip ou le poignarder. Le tournage se fait en cliquant sur la carte Atou. Les règles correspondent aux schnapsen autrichiens.

# im0_text
source: Player card 1
fr: carte 1 de joueur

# im1_text
source: Player card 2
fr: carte 2 de joueur

# im2_text
source: Player card 3
fr: carte 3 de joueur

# im3_text
source: Player card 4
fr: carte 4 de joueur

# im4_text
source: Player card 5
fr: carte 5 de joueur

# imAtou_text
source: Atou card
fr: carte d'atou

# imgCOut0_text
source: Computer card 0
fr: carte d'ordinateur 0

# imgCOut1_text
source: Computer card 1
fr: carte d'ordinateur 1

# imgCOut2_text
source: Computer card 2
fr: carte d'ordinateur 2

# imgCOut3_text
source: Computer card 3
fr: carte d'ordinateur 3

# imgCOut4_text
source: Computer card 4
fr: carte d'ordinateur 4

# imMerge_text
source: Merging animation
fr: animation de fusion

# imOut0_text
source: Playout card
fr: carte à jouer

# imOut1_text
source: Answer card
fr: carte de réponse

# imTalon_text
source: Talon card
fr: carte de talon

# last_hit_you_have_won
source: Last trick: you win!
de: Letzter Stich: Sie haben gewonnen !
fr: dernier point: vous avez gagné!

source: Learn more
de: Mehr erfahren
fr: en savoir plus

source: Merging cards
de: Mische Karten
fr: mélanger des cartes

# newgame_starts
source: Start a new game
de: Neues Spiel started
fr: nouvelle partie a commencé

# nogame_started
source: No game has been started!
de: Kein Spiel gestartet!
fr: aucune partie commencée!!

source: no second pair
de: kein 2. Paar
fr: pas de 2ème paire

# player_closed_game
source: Player closes game!
de: Spieler dreht zu !
fr: joueur annonce la clôture!

# polish_cards
source: polish cardset
de: Polnische Karten
fr: cartes de Bologne

source: say pair
de: ansagen
fr: annonce mariage

# this_is_no_valid_card
source: This is no valid card to play!
de: Das ist keine gültige Karte !
fr: ceci n'est pas une carte valide!

# tMes_text
source: Short information
fr: info-bulle

# toplayout_clickon_card
source: Click on card symbol to play out that card.
de: Zum Auspielen einfach auf die entsprechende Karte klicken
fr: pour jouer, il vous suffit de cliquer sur la carte appropriée

source: Twenty and enough!
de: 20 und genug !
fr: vingt et finit!

# twenty_in_color
source: Twenty in
de: Zwanzig in
fr: vingt en marriage de

# ukraine_cards
source: ukraine cardset
de: Ukraine Konfliktdeck
fr: cartes de Minsk

# us_cards
source: future_us_cards
fr: cartes futuristes des Etas-Unis

source: you
de: Du
fr: vous

# your_hit_points
source: Your hit with {0} points
de: Ihr Stich mit {0} Punkten.
fr: vous remportez la main avec {0} points.

# you_must_play_color_hit_force_rules
source: Follow the suit led stict rules!
de: Farb und Stichzwang muss eingehalten werden !
fr: clôture doive être respecté!

# you_must_play_pair_card
source: You must play out queen or king when marriages!
de: Sie muessen eine Karte vom Paar ausspielen !
fr: vous devez jouer une carte de la mariage!

# you_say_pair
source: Thou announce a marriages in color {0}!
de: Sie sagen Paar in {0} an!
fr: vous annoucez mariage à {0}!

# action_options
source: Options
de: Optionen

# call_10_hole
source: 10 hole
de: 10er Loch

# call_ace_beggar
source: Ace beggar
de: As-Bettler

# call_beggar
source: Beggar
de: Bettler

# call_default_game
source: Default game
de: Normales Spiel

# call_farmers_schnapser
source: Farmer's Schnapser
de: Bauern-Schnapser

# call_march_through
source: March through
de: Durchmarsch

# call_sirs_schnapser
source: Sir's Schnapser
de: Herren-Schnapser

# clickon_start
source: Click on 'Start' button to start a new game.
de: Klicke auf 'Start' um ein neues Spiel zu starten.

# computer_won_taylor
source: Computer won tournament. You're a taylor!
de: Du bekommst einen Schneider.

# continue_ToolTip
source: Click here to continue.
de: Klicken sie hier auf weiter!

# imageAtou_AltText
source: Game is closed!
de: Spiel ist zugedreht.

# imageAtou_ToolTip
source: Click on atou to close game!
de: Auf Atou klicken für Zudrehen.

# imageMerge_ToolTip
source: Click here to start a new game.
de: Hier klicken um ein Spiel zu starten.

# image_fist
source: Tap deck with fist to start.
de: Draufklopfen!

# image_take
source: Take half of merged deck to start.
de: Abheben!

# sPoints
source: Points
de: Punkte

# you_won_taylor
source: You won tournament. Computer lost as a taylor.
de: Computer bekommt einen Schneider.

# you_won_tournement
source: You won tournament. Computer's marked with a fat point.
de: Computer bekommt ein Bummerl.
